app/controllers/songs_controller.rb

  def index
  #if params[:artist_id]
    #@artist = Artist.find_by(id: params[:artist_id])
    #if @artist.nil?
    @artists = Artist.all
---
SELECT "artists".* FROM "artists"